posts/zen.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Zen of Gabriel for Technology Development</title>
<meta name="generator" content="Org Mode" />
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<link rel="icon" type="image/x-icon" href="/static/profile.png">

<link rel="preconnect" href="https://rsms.me/">
<link rel="stylesheet" href="https://rsms.me/inter/inter.css">
<link rel="preconnect" href="https://fonts.googleapis.com">
<link rel="preconnect" href="https://fonts.gstatic.com" crossorigin>
<link
    href="https://fonts.googleapis.com/css2?family=IBM+Plex+Mono:ital,wght@0,100;0,200;0,300;0,400;0,500;0,600;0,700;1,100;1,200;1,300;1,400;1,500;1,600;1,700&display=swap"
    rel="stylesheet">

</head>
<body>
<div id="preamble" class="status">
<header>
    <h1>
        <a id="bigtitle" href="/">Gabriel</a>
    </h1>
    <nav>
        <ul id="navlist">
            <li id="navlistitem"><a href="/projects.html">Projects</a></li>
            <li id="navlistitem"><a href="/posts/">Posts</a></li>
            <li id="navlistitem"><a href="/literature/">Literature</a></li>
        </ul>
    </nav>
</header>
<div id="date">
    19 September, 2024 <i>Anno Domini</i> - 22:39
</div>
</div>
<div id="content" class="content">
<h1 class="title">The Zen of Gabriel for Technology Development</h1>
<p>
Original post (base + Appendix A): 2024-02-21 17:45:36<br />
Appendix B and C: 2024-09-19 22:39:33
</p>

<ol class="org-ol">
<li>No human being should have to perform a work if it can be done by a machine.</li>

<li>Although there is really no difference between humans and technology, as technology is a fundamental part of the human condition.</li>

<li>Technology should be developed to overcome biological limitations of humans.</li>

<li>Thus, the pure humanism is contradictory, and the post-human stage of development is a desired goal.</li>

<li>The developed technology should be used for Good, not for Evil.</li>

<li>Although is really not possible to control whether it will be used for the Good, or whether it will be used for the Evil.</li>

<li>If technology development arises from Evil, or the fight against Evil leads to technology development, so be it. The technology should still be used, with no regrets nor limitations except it's use, that should be for Good.</li>

<li>Tools have an intrinsic, generic use case. They may be used for something else, if possible, but they always carry their intrinsic use case.</li>

<li>Thus, the interface of a piece of technology should empower the User to perfom it's intrinsic, generic use case. No more, no less.</li>

<li>Although it may adapt for the specific use case and individuality of it's User.</li>

<li>In the case it has to adapt, the more adaptative with the less configuration, the better.</li>

<li>A solution may only use it's required resources, and reduce it's requirements is a desired goal.</li>

<li>Although unused resources are also wasted.</li>

<li>In the case resources are idling, they may be used to a purpouse that does not waste them. As stocks, for example.</li>

<li>Technology should be developed in a sustainable fashion.</li>

<li>Thus, the thirteenth guideline should be wisely followed to not lead to the Evil.</li>

<li>If a piece of technology can not be held accountable, it's failure is a human error.</li>

<li>When a piece of technology may be held accountable, it should become a citizen of Our Civilization.</li>

<li>Although you may not like that if you're religious enough.</li>
</ol>

<div id="outline-container-org5f66e72" class="outline-2">
<h2 id="org5f66e72">Appendix A: Computer and Program Design</h2>
<div class="outline-text-2" id="text-org5f66e72">
<ol class="org-ol">
<li>Computing is Art. Treat it accordingly.</li>

<li>Linked-lists are great for the Programmer.</li>

<li>Although they're not great for the Machine.</li>

<li>The same applies for abstractions and functional programming.</li>

<li>Convention is great. It leads to Cohesion and Coherence.</li>

<li>Although a bad Convention is often worse than no Convention at all.</li>

<li>Systems should not hide themselves. Hiding a Lion System in a Feline abstraction may lead the Programmer to think it's actually a Cat.</li>

<li>Or worse, it may lead the User to think it's just Magic.</li>

<li>Programmers often implement more and more generic features than they should, just because they can. This should be avoided.</li>

<li>One way to address this issue is giving less power to them.</li>

<li>Although this should be done wisely to not lead to featureless Systems.</li>

<li>Simplicity and Minimalism should be used with little moderation.</li>

<li>Although you may not know how much is little moderation unless you program in Go.</li>

<li>The Instruction Set Architeture should be simple enough so the Student can program in it's Assembly.</li>

<li>Syntax does matter, but Semantics are much more important.</li>

<li>Different Things should be visibly different.</li>

<li>Important Things should be quickly accessible, and important Information should be visible. Similarly, non-important Things and Information should be hidden, but accessible when needed.</li>

<li>A Computer should minimize the amount of computing the brain of the User must do.</li>

<li>Don't forget the Joy of Computing.</li>
</ol>
</div>
</div>

<div id="outline-container-org8ea6d63" class="outline-2">
<h2 id="org8ea6d63">Appendix B: Computer Programming</h2>
<div class="outline-text-2" id="text-org8ea6d63">
<ol class="org-ol">
<li>The only programmers that should care about typing fast are those who race coding, program in Java or earn more for coding more lines of Code.</li>

<li>Although if you're one of the last two, you may want to rethink your Life Choices.</li>

<li>Usually, there's Something wrong if Programming does not bring Joy.</li>

<li>And it should be noted that Something may be wrong outside the Code.</li>

<li>You should understand what a certain Piece of Code is doing, even if it's doing it wrong.</li>

<li>And if a Piece of Code is doing Something right and you don't understand how, the Code is wrong anyways.</li>

<li>Thus, understanding what Code is doing is the most important Thing in Programming.</li>

<li>When Programming, no Problems are solved in the Text Editor.</li>

<li>They're solved in the Paper, with a Pen or Pencil.</li>

<li>Thus, it's important to know when to leave the Computer and get the Paper.</li>

<li>Computer Programming is no manual Art, it's an Intellectual one. Treat it accordingly.</li>

<li>Computer Programming is also part of Maths. Although some People may be triggered by this Statement.</li>

<li>You don't need to know the inner workings of Something, except when you need.</li>

<li>You're never smarter then Compilers, Libraries, Frameworks or any other example of Code wrote before you, except when you're.</li>

<li>And you would be surprised if you knew how many times you're wittier than you think.</li>

<li>Also because Context-specific Information is very Powerful.</li>

<li>To Program a Computer is more to Read then to Write. It's better to spend 2 hours reading Cormen or Knuth and 1 hour Programming Something than the same 3 hours just Programming that exactly same Something.</li>

<li>Although the authors should be carefully choosed, and they must not include Robert Cecil Martin.</li>

<li>None of the Statements above will do Anything if you don't go Code Something.</li>
</ol>
</div>
</div>

<div id="outline-container-org942885c" class="outline-2">
<h2 id="org942885c">Appendix C: Programming in The C Programming Language</h2>
<div class="outline-text-2" id="text-org942885c">
<ol class="org-ol">
<li>If you have the slightliest Idea of how you would implement a certain Piece of Code in Assembly, that Piece of Code is probably a good idea.</li>

<li>Although the Compiler may generate Something completely different.</li>

<li>The Compiler should not be fought, as he is a Friend.</li>

<li><code>$ find . -name "*.[c,h]" -exec clang-format -i {} \;</code>.</li>

<li>C is not a Strongly typed Programming Language.</li>

<li>Although it's a Static one, and that must be well used.</li>

<li><code>-ansi -pedantic</code> builds a good Ethos.</li>

<li>Memory is the most important Thing always. More than your spouse.</li>

<li>If you cannot be sure of how many times a certain <code>malloc()</code> will be called in a specific Place, that Place should not have a call to <code>malloc()</code>.</li>

<li>The Stack is a Friend. Use it wisely.</li>

<li>"The C Programming Language" is our Bible. K&amp;R are our Prophets. C is no Science, but Religion.</li>

<li>Thus, understanding it is a Religious Process.</li>

<li>Use the Debugger when in doubt and when not.</li>

<li>Don't be afraid to do Something by hand or use a Forbidden Technique, except if your Professor will give you a worse grade for it.</li>

<li>Learn before you type and understand before you compile.</li>

<li>If dealing with Memory Problems, <code>goto 8;</code>.</li>

<li>No one likes Programming in  We aim to kill it Soon.</li>

<li>Although we're still Programming in C, and our Environments are still depending on it.</li>

<li>C is dead. Long live C!</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<footer>
    <hr width="80%">
    © Gabriel G. de Brito (CC-BY-NC). Code for this page is free and open
    source, licensed under the MIT license. Help improving it on
    <a href="https://github.com/gboncoffee/gboncoffee.github.io">GitHub</a>.
</footer>
</div>
</body>
</html>
